# 2. Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке строк некое число.

# list = [4, 7, 'red', 13, 16, 19, 'чис3ло', '3']
# new_list = dict.values()
# print(new_list)
# n = input('Введите искомое число ')
# count = 0
# for i in list:
#     i = str(i)
#     if n in i:
#         print("Да есть")
#         count = 1
#         break
# if count == 0:
#     print("Отсутствует")

# Решение №2

# list = ["1", "4", "6", "z"]
# n = (input("Введите число: "))
# print(n in list)
